{"toolTipTexts":[{"id":132,"text":"The New Age Alpha U.S. Large-Cap Leading 50 Index consists of 50 U.S. stocks in the S&P 500 as ranked by the combination of Human Factor score (“HF”), and other rules-based criteria as defined by the index methodology."},{"id":139,"text":"The New Age Alpha U.S. Small-Cap Leading 50 Index consists of 50 U.S. stocks in the S&P 600 as ranked by the combination of Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":22,"text":"The New Age Alpha Europe Ex-UK Leading 50 Index consists of 50 stocks in the S&P Ex-UK BMI as ranked by the combination of Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":14,"text":"The New Age Alpha UK Leading 50 Index consists of 50 stocks in the S&P United Kingdom BMI as ranked by the combination of Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":18,"text":"The New Age Alpha Japan Leading 50 Index consists of 50 stocks in the S&P Japan BMI as ranked by the combination of Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":59,"text":"The New Age Alpha Developed World Ex-US Leading 50 Index consists of 50 stocks in the S&P Developed Ex-US BMI as ranked by the combination of Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":134,"text":"The New Age Alpha U.S. Large-Cap Low Volatility 50 Index consists of 50 U.S. stocks in the S&P 500 as ranked by the combination of Human Factor score (“HF”), standard deviation and other rules-based criteria as defined by the Index methodology."},{"id":138,"text":"The New Age Alpha U.S. Small-Cap Low Volatility 50 Index consists of 50 U.S. stocks in the S&P 600 as ranked by the combination of Human Factor score (“HF”), standard deviation and other rules-based criteria as defined by the index methodology."},{"id":24,"text":"The New Age Alpha Europe Ex-UK Low Volatility Index consists of 100 stocks in the S&P Euriope Ex-UK as ranked by the combination of Human Factor score (“HF”), standard deviation and other rules-based criteria as defined by the index methodology."},{"id":16,"text":"The New Age Alpha UK Low Volatility Index consists of 100 stocks in the S&P United Kingdom BMI as ranked by the combination of Human Factor score (“HF”), standard deviation and other rules-based criteria as defined by the index methodology."},{"id":20,"text":"The New Age Alpha Japan Low Volatility Index consists of 100 stocks in the S&P Japan BMI as ranked by the combination of Human Factor score (“HF”), standard deviation and other rules-based criteria as defined by the index methodology."},{"id":60,"text":"The New Age Alpha Developed World Ex-US Low Volatility Index consists of 100 stocks in the S&P Developed World Ex-US BMI as ranked by the combination of Human Factor score (“HF”), standard deviation and other rules-based criteria as defined by the index methodology."},{"id":141,"text":"The New Age Alpha U.S. Large-Cap ESG Index consists of 50 U.S. stocks in the Refinitiv U.S. Total Return Index as ranked by the combination of ESG score, Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":67,"text":"The New Age Alpha U.S. Large-Cap ESG Index consists of 50 U.S. stocks in the Refinitiv U.S. Total Return Index as ranked by the combination of Environmental score, Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":64,"text":"The New Age Alpha U.S. Large-Cap ESG Index consists of 50 U.S. stocks in the Refinitiv U.S. Total Return Index as ranked by the combination of Social score, Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":65,"text":"The New Age Alpha U.S. Large-Cap ESG Index consists of 50 U.S. stocks in the Refinitiv U.S. Total Return Index as ranked by the combination of Governance score, Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":140,"text":"The New Age Alpha U.S. Large-Cap ESG Index consists of 125 U.S. stocks in the Refinitiv U.S. Total Return Index as ranked by the combination of ESG score, Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":109,"text":"The New Age Alpha United Kingdom ESG 50 Index consists of 50 stocks in the Refinitiv United Kingdom Total Return Index as ranked by the combination of ESG score, Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":110,"text":"The New Age Alpha United Kingdom ESG 50 Index consists of 50 stocks in the Refinitiv United Kingdom Total Return Index as ranked by the combination of ESG score, Human Factor score (“HF”), downside deviation, and other rules-based criteria as defined by the Index methodology."},{"id":111,"text":"The New Age Alpha Japan ESG 50 Total Return Index consists of 50 stocks in the Refinitiv Japan Total Return Index as ranked by the combination of ESG score, Human Factor score (“HF”), and other rules-based criteria as defined by the Index methodology."},{"id":112,"text":"The New Age Alpha Japan ESG 50 Total Return Index consists of 50 stocks in the Refinitiv Japan Total Return Index as ranked by the combination of ESG score, Human Factor score (“HF”), and downside deviation, and other rules-based criteria as defined by the Index methodology."},{"id":76,"text":"The New Age Alpha USD High Yield Corporate Bond Index includes 120 bonds, selected by a combination of Human Factor scores (“HF score”), par amounts, and other rule-based criteria described in this methodology."},{"id":130,"text":"The New Age Alpha USD High Yield ESG Corporate Bond Index includes 120 bonds, selected by a combination of Human Factor scores (“HF score”), ESG scores, par amounts, and other rule-based criteria described in this methodology."},{"id":120,"text":"The New Age Alpha U.S. Large-Cap Long Index consists of 20 U.S. stocks in the S&P 500 as ranked by the combination of Human Factor score (“HF”), idiosyncratic volatility and other rules-based criteria as defined by the Index methodology."},{"id":116,"text":"The New Age Alpha U.S. Large-Cap Short Index consists of 20 U.S. stocks in the S&P 500 as ranked by the combination of Human Factor score (“HF”), idiosyncratic volatility and other rules-based criteria as defined by the Index methodology."}],"universe":"This number represents the median Human Factor of all stocks in the respective universe.","rightMenuTooltipText":{"Weight_price":"The percentage represents the suggested Human Factor weighting for a portfolio consisting of securities listed in the table below. The price shown is the current security price.","miden":"This number represents the Human Factor of the security."},"gArcLine":{"data_gArcMidenText":"This line identifies the median Human Factor within the selected universe.","data_gArcMidText":"The overpricing/underpricing line separates the stocks within the universe that have a Human Factor > or < 50."},"PerformanceTitleTooltip":["These statistics show performance before and after removing the losers."]}
